app/controllers/v1/admins_controller.rb

  def workers
    workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def customers
    customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def events
    events = Event.all
---
SELECT "events".* FROM "events"