app/controllers/v1/customers_controller.rb

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Tangggg"], ["updated_at", "2018-02-08 21:14:18.143859"], ["id", 1]]
---
    def update
      if current_customer.update(:name => request.headers[:name],:phone_number => request.headers[:phone_number], :area => request.headers[:area], :location => request.headers[:location])