app/controllers/v1/customer_events_controller.rb

    def create
        event = Event.new(event_params)
        event.customer_id = current_customer.id
        #the first worker is empty worker means: searching worker
        event.worker_id = 2
        if event.save
---
INSERT INTO "events" ("message", "location", "customer_id", "worker_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["message", "third event"], ["location", "from postman"], ["customer_id", 1], ["worker_id", 1], ["created_at", "2018-02-08 18:08:44.625295"], ["updated_at", "2018-02-08 18:08:44.625295"]]

    def update
        event = current_customer.events.find(params[:id])
        if event.update(:detail => request.headers['detail'],:event_type => request.headers['event_type'],
                        :area => request.headers['area'], :address => request.headers['address'],
                        :free_time => request.headers['free_time'])
---
SELECT  "events".* FROM "events" WHERE "events"."customer_id" = ? AND "events"."id" = ? LIMIT ?  [["customer_id", 1], ["id", 5], ["LIMIT", 1]]
UPDATE "events" SET "event_type" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_type", 5], ["updated_at", "2018-03-01 22:58:44.405707"], ["id", 5]]

    def destroy
        event = current_customer.events.find(params[:id])
        if event
            if event.status == "searching"
                event.status = "cancelled"
                if event.save
---
SELECT  "events".* FROM "events" WHERE "events"."customer_id" = ? AND "events"."id" = ? LIMIT ?  [["customer_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "tokens" = ?, "updated_at" = ? WHERE "customers"."id" = ?
UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", 4], ["updated_at", "2018-02-14 01:37:05.832053"], ["id", 6]]