app/controllers/v1/events_controller.rb

    def index
        if params[:status] == "searching"
            events = Event.where(status: "searching")
        elsif params[:status] == "finished"
            events = current_worker.events.where(status: "finished")
---
SELECT "events".* FROM "events" WHERE "events"."status" = ?  [["status", 0]]
SELECT "events".* FROM "events" WHERE "events"."worker_id" = ? AND "events"."status" = ?  [["worker_id", 1], ["status", 3]]

    def accepted
        if current_worker.events.exists?(params[:id])
            event =  current_worker.events.find(params[:id])
            event.status = "accepted"
            event.save
---
SELECT  "events".* FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "status" = ?, "updated_at" = ?, "accept_time" = ? WHERE "events"."id" = ?  [["status", 1], ["updated_at", "2018-02-22 03:22:45.867096"], ["accept_time", "2018-02-22 03:22:41 UTC"], ["id", 1]]
UPDATE "workers" SET "tokens" = ?, "updated_at" = ? WHERE "workers"."id" = ?

    def processing
        if current_worker.events.exists?(params[:id])
            event =  current_worker.events.find(params[:id])
            event.status = "processing"
            event.save
---
SELECT  "events".* FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", 2], ["updated_at", "2018-02-22 03:23:08.379290"], ["id", 1]]