app/controllers/v1/workers_controller.rb

UPDATE "workers" SET "name" = ?, "updated_at" = ? WHERE "workers"."id" = ?  [["name", "Pikaqiu"], ["updated_at", "2018-02-14 00:47:35.017998"], ["id", 1]]
---
    def update
      if current_worker.update(:name => request.headers[:name])

SELECT  "events".* FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "events" WHERE "events"."worker_id" = ? AND "events"."id" = ? LIMIT ?  [["worker_id", 1], ["id", 7], ["LIMIT", 1]]
UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", 3], ["updated_at", "2018-02-08 21:52:22.840819"], ["id", 3]]
UPDATE "workers" SET "tokens" = ?, "updated_at" = ? WHERE "workers"."id" = ?
---
    def destroy

      if current_worker.events.exists?(params[:id])
        event = current_worker.events.find(params[:id])
        event.status = "finished"
        event.save