app/controllers/v1/workers_controller.rb

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
      worker = Worker.find(params[:id])